## plan for staging
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.main will be created
+   resource "aws_db_instance" "main" {
+       address                               = (known after apply)
+       allocated_storage                     = 20
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = 0
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "demoecs"
+       db_subnet_group_name                  = "demo-ecs-staging-main"
+       delete_automated_backups              = true
+       endpoint                              = (known after apply)
+       engine                                = "postgres"
+       engine_version                        = "11.14"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = "demo-ecs-staging-db"
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t2.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       maintenance_window                    = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = false
+       name                                  = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = "gp2"
+       tags                                  = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       tags_all                              = {
+           "Environment" = "staging"
+           "ManagedBy"   = "Terraform"
+           "Name"        = "demo-ecs-staging-main"
+           "Owner"       = "email@calvineotieno.com"
+           "Project"     = "demo-ecs-devops"
        }
+       timezone                              = (known after apply)
+       username                              = "demoecsapp"
+       vpc_security_group_ids                = [
+           "sg-00811d2064457af61",
        ]
    }

  # aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-00811d2064457af61"
      ~ ingress                = [
+           {
+               cidr_blocks      = []
+               description      = ""
+               from_port        = 5432
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 5432
            },
        ]
        name                   = "demo-ecs-staging-rds-inbound-access"
        tags                   = {
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "email@calvineotieno.com"
            "Project"     = "demo-ecs-devops"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   db_host = (known after apply)
```